// import React, { useState } from "react";
// import ContainerAbout from './About.styled.js'


// import Headline from "../../ui/Headline/Headline";

const About = () => {
  // const [isLoading, setIsLoading] = useState(true);
  // const ref = useRef(null);

  return (
    <>
    <section id='about'>
        {/* <Headline ref={ref} text={"Про майстра"}/> */}
        <h2>Про майстра</h2>
        <p>
          Мене звати Володимир і я професійний майстер телевізорів. У мене
          великий досвід роботи в цій галузі, понад 15 років. Починав свою
          кар’єру коли люди користувалися ламповими телевізорами з монохромним
          зображенням. Технології постійно змінюються, надають споживачеві нових
          продуктів. Тому я завжди вдосконалюю свої навички, щоб надавати
          клієнтам найкращий сучасний сервіс.
        </p>
        <ul>
          <span>Що я можу: </span>
          <li>
            <span>
              швидко і якісно усунути будь-яку проблему з телевізором, незалежно
              від її складності.
            </span>
          </li>
          <li>
            <span>
              встановити антену так, щоб вона забезпечувала найкращий сигнал.
            </span>
          </li>
          <li>
            <span>
              налаштувати будь-яке телевізійне обладнання, щоб ви могли
              насолоджуватися вашими улюбленими передачами в найкращій якості.
            </span>
          </li>
        </ul>
      </section>
    </>
  );
};
export default About;
